nofshonit/frontend/nofshonit-matanot-search-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: nofshonit-matanot-search-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: nofshonit-matanot-search-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  nofshonit-matanot-search-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(https://testclientnofshonit.dts.co.il/)
      - clickByCSS(i.heart.large.icon.favorites-link-icon)
      - clickByCSS(button.ui.circular.primary.button.toGiftsBtn)
      - clickByXPath(//div[@id='__next']/div/div[2]/div[2]/div[2]/div/div[4]/div[2]/div/div[2]/div[8]/div/a/div/img)

  nofshonit-matanot-search-Http:
    headers:
      Sec-Fetch-Mode: cors
      Origin: 'https://testclientnofshonit.dts.co.il'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.90 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://testbacknofshonit.dts.co.il/api/category/getCategoryFilterPage'
            method: OPTIONS
            label: 'https://testbacknofshonit.dts.co.il/api/category/getCategoryFilterPage'
            headers:
              Access-Control-Request-Method: POST
              Access-Control-Request-Headers: 'content-type,organizationid,token'
              Accept: '*/*'
          - url: 'https://testbacknofshonit.dts.co.il/api/category/getCategoryFilterPage'
            method: POST
            label: 'https://testbacknofshonit.dts.co.il/api/category/getCategoryFilterPage'
            headers:
              organizationId: '38'
              Content-Type: application/json;charset=UTF-8
              Accept: 'application/json, text/plain, */*'
              token: elUWUr6cin9svwE4fDLSkyAiemcvJ72LOn0QHCbbPygCItzTQoxhnnaGzipwvlJbAmrMIROtOt3dJwVL1fLhViu/9AiW3WTddkhvFCMD+ffn27p60j7OrPHbnBFInaD6OjZ9JI51z6vJXhb6dFH2oOvRkkOxu3Rb7cKRpvzEUTBdNlL8f49JAy+GJ4vsS8uYH9icR6E/XeEPrpAveEtMz+a4c7KxeBm022vBFZFIUZv8lEC4vohfcHLT2jgmoLIdPztz2jq1jQfRrzpKfZJHGI8kvSGrFHXIiIhdu9B6S1jbcyrakKMnQUQqhW+w9MwBO3dlap7/kCbRyyXLiIFDRzrqYADj3nP87bPlWMaZkkEXkvEy/YyemSmRnG5lt1Fi4Ogbrbd3ZAM/fK6R+C5h4r89IlekB8r4xxr3uS8FvKIzOiRcRLAe44+v+RYrGY7blsTN6cFB+VRWOM0zf7YBPmR+K3Za6OE5qbbYdHCT1r5sERb0j1rZAE/Spo11auCxKNHMXwc8JC5yB1rB9VZJffsE2S3HG0TBSVG0iQ3/OI1qkkyTKE1X4UK5ka+buKgABJrMXH4lYAzPj2HzITk0+FImIznVjsqA3PNYycB4zvhyp+ZXFDCyqJolkijU1UPxmL98quym+srffGChb6c2AnRs4hiKHFfMYhEJ41dcA6Y=
            body: '{"amountPerPage":21,"pageNumber":1,"priceSort":0,"categoryTagIDs":[0]}'
          - url: 'https://testbacknofshonit.dts.co.il/api/category/GetCategoryPage?categoryId=43214'
            method: OPTIONS
            label: 'https://testbacknofshonit.dts.co.il/api/category/GetCategoryPage?categoryId=43214'
            headers:
              Access-Control-Request-Method: GET
              Access-Control-Request-Headers: 'organizationid,token'
              Accept: '*/*'
          - url: 'https://testbacknofshonit.dts.co.il/api/category/GetCategoryPage'
            method: GET
            label: 'https://testbacknofshonit.dts.co.il/api/category/GetCategoryPage'
            headers:
              Accept: 'application/json, text/plain, */*'
              organizationId: '38'
              token: elUWUr6cin9svwE4fDLSkyAiemcvJ72LOn0QHCbbPygCItzTQoxhnnaGzipwvlJbAmrMIROtOt3dJwVL1fLhViu/9AiW3WTddkhvFCMD+ffn27p60j7OrPHbnBFInaD6OjZ9JI51z6vJXhb6dFH2oOvRkkOxu3Rb7cKRpvzEUTBdNlL8f49JAy+GJ4vsS8uYH9icR6E/XeEPrpAveEtMz+a4c7KxeBm022vBFZFIUZv8lEC4vohfcHLT2jgmoLIdPztz2jq1jQfRrzpKfZJHGI8kvSGrFHXIiIhdu9B6S1jbcyrakKMnQUQqhW+w9MwBO3dlap7/kCbRyyXLiIFDRzrqYADj3nP87bPlWMaZkkEXkvEy/YyemSmRnG5lt1Fi4Ogbrbd3ZAM/fK6R+C5h4r89IlekB8r4xxr3uS8FvKIzOiRcRLAe44+v+RYrGY7blsTN6cFB+VRWOM0zf7YBPmR+K3Za6OE5qbbYdHCT1r5sERb0j1rZAE/Spo11auCxKNHMXwc8JC5yB1rB9VZJffsE2S3HG0TBSVG0iQ3/OI1qkkyTKE1X4UK5ka+buKgABJrMXH4lYAzPj2HzITk0+FImIznVjsqA3PNYycB4zvhyp+ZXFDCyqJolkijU1UPxmL98quym+srffGChb6c2AnRs4hiKHFfMYhEJ41dcA6Y=
            body:
              categoryId: '43214'